[
{"url": "https://reddead.fandom.com/wiki/Red_Dead_Redemption_2", "name": "Red Dead Redemption 2", "image": "https://static.wikia.nocookie.net/reddeadredemption/images/0/0a/Reddeadcover.jpg/revision/latest/scale-to-width-down/268?cb=20180503145113", "description": "(stylized as  ) is a western-themed action-adventure video game developed and published by  . It is the third entry in the   series and a prequel to 2010's   and was released on October 26th, 2018  on PlayStation 4, Xbox One  and on November 5th, 2019 for PC.\n Set in a fictional recreation of the American Old West in 1899,   focuses on the life of   and his position in the notorious  . The game follows the gang's decline as they are pursued by lawmen, fellow gangs and   agents. The narrative rev...", "attributes": {"Developer": "Rockstar Studios [ 1 ]", "Publisher": "Rockstar Games", "Release date": "October 26, 2018 (PS4, Xbox One) November 5, 2019 (PC) December 5, 2019 (Steam)", "Genre": "Action-adventure", "Engine": "RAGE", "Modes": "Singleplayer, Multiplayer", "Rating": "CERO : Z ESRB : M PEGI : 18 USK : 18 ACB : MA15+", "Platforms": "Native ps4 PlayStation 4 xboxone Xbox One ps4pro Playstation 4 Pro xboxonex Xbox One X pc Microsoft Windows stadia Google Stadia Backward Compatible PlayStation 5 Xbox Series X/S", "Media": "Blu-ray, digital download", "System requirements": "Console : 105 GB Minimum [ 2 ]", "Reviews": "metacritic Metacritic : 97% gamerankings Gamerankings : 96.45%", "PC": "Steam", "Xbox": "Xbox Network", "PlayStation": "PSN"}},
{"url": "https://leagueoflegends.fandom.com/wiki/League_of_Legends_Wiki", "name": "Home", "image": null, "description": "", "attributes": {}},
{"url": "https://gta.fandom.com/wiki/Grand_Theft_Auto_V", "name": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/7/76/CoverArt-GTAV.png/revision/latest/scale-to-width-down/268?cb=20250708181846", "description": "(also known as  ,  ,  , and  ) is a video game developed by  . It is the fifteenth installment in the   series and the fifth game title in the   of the series.\n The original edition was released on September 17,  , for the   and  . The   and   \"enhanced\" versions were released on November 18,  , and was later released on April 14,  , for the  . A further \"expanded and enhanced\" version for the   and   released on March 15,  .  It was made available for the PC on March 4,  .\n Optionally, players ...", "attributes": {"Type": "GAME", "Developer(s)": "Rockstar North", "Publisher(s)": "Rockstar Games", "Producer(s)": "Leslie Benzies Imran Sarwar", "Writer(s)": "Dan Houser Rupert Humphries Michael Unsworth", "Composer(s)": "Tangerine Dream Woody Jackson The Alchemist Oh No DJ Shadow", "Platform(s)": "PlayStation 3 PlayStation 4 PlayStation 5 Xbox 360 Xbox One Xbox Series X|S PC", "PlayStation 3": "September 17 2013 September 17 2013 September 17 2013 October 10 2013 July 17 2025", "Xbox 360": "September 17 2013 September 17 2013 September 17 2013 October 10 2013 July 17 2025", "PlayStation 4": "November 18 2014 November 18 2014 November 18 2014 December 11 2014 July 17 2025", "Xbox One": "November 18 2014 November 18 2014 November 18 2014 December 11 2014 July 17 2025", "PC": "April 14 2015 July 17 2025", "PlayStation 5": "March 15, 2022 July 17 2025", "Xbox Series X/S": "March 15, 2022 July 17 2025", "Engine": "RAGE", "Supported Languages": "English French Italian German Spanish Japanese Russian Polish Brazilian Portuguese Traditional Chinese Simplified Chinese [ EV / E&E ] Latin American Spanish Korean", "Protagonist(s)": "Michael De Santa Franklin Clinton Trevor Philips", "Location(s)": "State of San Andreas Los Santos County Blaine County State of North Yankton Ludendorff (briefly) (briefly) Appears in Prologue, Bury the Hatchet and End Credits only", "Timeline": "2013 (Main Events) 2004 ( Prologue )", "Universe": "HD Universe", "Preceded by": "Grand Theft Auto: Chinatown Wars (March 17, 2009) Grand Theft Auto Online (October 1, 2013) Grand Theft Auto VI (May 26, 2026; scheduled release)", "Label": "Field"}},
{"url": "https://nfs.fandom.com/wiki/Need_for_Speed:_Unbound", "name": "Need for Speed: Unbound", "image": "https://static.wikia.nocookie.net/nfs/images/a/a7/NFSUB_Boxart.jpg/revision/latest/scale-to-width-down/268?cb=20221006192511&path-prefix=en", "description": "is the thirtieth game in the   and the first since   to be mainly developed by  .\n It was announced on October 6, 2022 by publisher   to be released for PC, PlayStation 5, and Xbox Series X/S on December 2, 2022. A three day early access period for those that pre-order the Palace Edition was also announced, starting on November 29, 2022.\n Starting on November 29, 2022, those with an EA Play subscription can play up to 10 hours of the standard release, and those with an EA Play Pro subscription c...", "attributes": {"Studios": "Criterion Games Codemasters Cheshire", "Publisher": "Electronic Arts", "Game Engine": "Frostbite (2021-2.3)", "Genre": "Racing/Arcade-Action", "Game Modes": "Single-player (Offline) Multiplayer (Cross-play optional): Autolog (Asynchronous) Online (2 to 16 players)", "Metacritic Score": "77 / 100", "Platforms": "PC (Windows 10) PlayStation 5 Xbox Series X/S", "PC (EA app)": "December 2, 2022", "PC (Epic Games Store)": "December 2, 2022", "PC (Steam)": "December 2, 2022", "PlayStation 5": "December 2, 2022", "Xbox Series X/S": "December 2, 2022", "Related Releases": "Need for Speed: Unbound - Palace Edition Need for Speed: Unbound - Ultimate Collection \"Creative Subversion\" kit"}},
{"url": "https://detroit-become-human.fandom.com/wiki/Detroit:_Become_Human", "name": "Detroit: Become Human", "image": "https://static.wikia.nocookie.net/detroit-become-human/images/7/72/Detroit_Become_Human_Cover_001.jpg/revision/latest/scale-to-width-down/268?cb=20190320202942", "description": "is a cinematic neo-noir thriller game developed by   and published for PlayStation 4, releasing also for Microsoft Windows. The game is the company's 5th title and their fourth interactive drama. It is written and directed by Quantic Dream's founder and co-CEO  . The game itself was released on May 25, 2018 and the Digital Premium Version was released a day before on May 24, 2018 for PlayStation 4. For Microsoft Windows, it was released on December 12, 2019, as an   exclusive. It received a wide...", "attributes": {"Developer": "Quantic Dream", "Publisher": "Sony Interactive Entertainment Quantic Dream (Microsoft Windows)", "Director": "David Cage Benjamin Diebling", "Producer": "Guillaume de Fondaumière Jason Stewart Sophie Buhl", "Writer": "David Cage Adam Williams", "Platform": "PlayStation 4 Microsoft Windows", "Release Date": "May 25, 2018 (PlayStation 4) December 12, 2019 (Microsoft Windows - Epic Games Store) June 18, 2020 (Steam Store)"}},
{"url": "https://detroit-become-human.fandom.com/wiki/Traci_(protagonist)", "name": "Traci", "game": "Detroit: Become Human", "image": "https://static.wikia.nocookie.net/detroit-become-human/images/6/6a/TracyIcon.png/revision/latest/scale-to-width-down/268?cb=20211128224248", "description": "Traci  was originally the name of a     and the cut fourth playable protagonist in  . She had around five to six scenes  written by  , but he later made the decision to remove her due to the increasing complexity of the branching narrative. \n Her name was repurposed in the final game to refer to all WR400 androids. It is unknown if all WR400 androids were also originally named \"Traci\" or if it was a unique name that she chose for herself.\n There is little known about Traci. According to  , Traci was going to disguise herself as a human and work as a journalist, where she could attempt to “tip the scales in favor of one side or the other\" depending on the player's choices. The artbook also uses the name \"Nathalie\" to refer to her, likely to avoid confusion with the repurposed name. According to concept artist Mikael Leger, \"Her initial story arc was amazing\" and describes her as   Traci.  He also confirms that \"Nathalie\" was an alias she could assume as part of her undercover journalism work.  \n There is concept art depicting Traci at  . It is unknown what circumstances would have led to this scene taking place.  \n According to concept artist Mikael Leger, there was a scene where Traci was going to be nude under a white coat.   This was probably going to take place during her chapter at the  , as she appears to be wearing the same white coat in the concept art of those deleted chapters.  \n It is unknown what Traci's personality would have been like. \n Traci is depicted as a young female android with shoulder-length blonde hair and brown eyes. All \"Traci\" models in the Eden Club shared this exact same appearance. \n Industry insider Tom Henderson has stated that Traci would have been able to \"morph her face and body\" as part of her abilities as a  . It is possible that this would have played into her ability to disguise herself for her work as a journalist.  \n Concept art of the Eden Club depicts Traci wearing a lacy black dress and a lingerie set. Later, she is shown wearing a knee-length black coat with heels at Ferndale Station and the Eden Club.      \n Traci's concept art uses the likeness of Israeli-American actress Alona Tal. Tom Henderson has also stated that American actress Amber Heard was used as inspiration for her.", "attributes": {"Aliases": "Nathalie", "Affiliation": "Jericho", "Place of birth": "CyberLife", "Species": "Android ( WR400 )", "Gender": "Female", "Eye color": "Brown", "Hair color": "Blonde", "Status": "Non-Canon", "Appears in:": "The Eden Club", "Portrayed by:": "Alona Tal"}},
{"url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_London", "name": "Protagonists in Grand Theft Auto: London 1969 and London 1961", "game": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556", "description": "", "attributes": {"Label": "Field", "Type": "CHARACTER", "Appears in": "Grand Theft Auto: London 1969 Grand Theft Auto: London 1961", "Voiced by": "None", "Gender": "Male", "Also known as": "The Cheese Grater The Cheese Grater Used by Harold Cartwright Guv'nor Guv'nor Used by the Crisps' Contact Gorgeous Gorgeous Used by the Crisps' Contact, Albert Crisp and Pretty Charlie Einstein Einstein Used by the Crisps' Contact if they fail an objective Petal Petal Used by Albert Crisp Angel Angel Used by Albert Crisp Sunbeam Sunbeam Used by Keith Endeavour Chambers Endeavour Chambers Used by the British government while posing as Endeavour Chambers Agent Temple Agent Temple Used by the British government while posing as Agent Temple", "Full name": "Character chosen by the player", "Nationality": "British", "Date of birth": "Not given", "Status": "Alive", "Home": "London , United Kingdom", "Family": "Unnamed child (c. 1969) [ 1 ] Unnamed girlfriend/wife (c. 1969) [ 2 ] [ 3 ] [ 4 ] [ 5 ]", "Main affiliations": "Jack Parkinson Albert Crisp (Formerly) Archie Crisp (Formerly) Harold Cartwright (Formerly) Her Majesty's Secret Service (Anonymously)", "Vehicles": "Player's choice", "Weapons": "Player's choice", "Businesses": "Espionage Car theft Contract killing Hired driver Drug dealing"}},
{"url": "https://gta.fandom.com/wiki/GTA_Online_Protagonist", "name": "Grand Theft Auto Online Protagonist", "game": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556", "description": "", "attributes": {"Type": "CHARACTER", "Appears in": "Grand Theft Auto Online", "Mentioned in": "Grand Theft Auto V [UN] [UN] Mentioned in dialogue or other in-game media but not physically seen in-game.", "Voiced by": "Player (optionally, via microphone) None (officially)", "Motion capture by": "Various", "Gender": "Player's choice", "Height": "6' 0\" (1.83 m) Male 5' 9\" (1.75 m) Female [ 1 ]", "Also known as": "Boss Boss Used by Garage Mechanic, Executive Assistant, Nightclub staff and Brendan Darcy Partner Partner Used by Ron Jakowski and Franklin Clinton Playa Playa Used by Lamar Silent Protege Silent Protege Used by Trevor Philips Ron 's Silent Friend Ron 's Silent Friend Used by Trevor Philips Trevor's Favorite Mute Trevor's Favorite Mute Used by Trevor Phillips Doolie/Cadork/Cadidiot Doolie/Cadork/Cadidiot Used by JT Boyd Raver/Geezer Raver/Geezer Used by English Dave Stranger Stranger Used by Maude Eccles Silent, Psychotic Peon Silent, Psychotic Peon Used by Avon Hertz Casino Buddy Casino Buddy Used by Tao Cheng Kapitan Kapitan Used by Pavel Tour manager Tour manager Used during The Cayo Perico Heist scoping mission King/Queen King/Queen Used by Hao in the LS Car Meet introduction Other Boss Other Boss Used by Imani Sleeping Beauty Sleeping Beauty Used by Lamar during Short Trip - Seed Capital Pimp Pimp Used by Lamar Agent Agent Used by Agent ULP Jefe/Jefa Jefe/Jefa Used by Lupe. ('Boss' in Spanish) CBL CBL Used by Omega during the 'Sightseeing' Halloween event. (Carbon-based lifeform) Freshmeat Freshmeat Used by the Fooliganz Freshmeat-o Freshmeat-o Used by Dax Freshmeatus Freshmeatus Used by Dax Freshius meatusaruras Freshius meatusaruras Used by the Fooliganz Freshmeatloaf Freshmeatloaf Used by Dax Dr. Freshmeatowitz Dr. Freshmeatowitz Used by Dax FM FM Used by Dax. Short for 'Freshmeat' FM radio FM radio Used by Dax. FM - short for 'Freshmeat' MeatFresh MeatFresh Used by Dax. Carne Fresca Carne Fresca Used by Luchadora, mentioned by Dax. Spanish/Portuguese for 'Freshmeat'. Team Leader/TL Team Leader/TL Used by the Los Santos Angels Officer Officer Used by Vincent Effenburger", "Full name": "Name chosen by the player", "Nationality": "Player's choice", "Date of birth": "Player's choice Indeterminate (Enhanced Version) Any year from 1973 to 1992 (Migrated from PS3 and Xbox 360 only)", "Status": "Alive", "Home": "San Andreas Player's choice", "Family": "Mom and Dad (Enhanced Version) Up to 4 unnamed grandparents (PS3/Xb360 only)", "Main affiliations": "Crews (determinant) Organizations SecuroServ Lamar Davis Gerald Simeon Yetarian Ron Jakowski Trevor Philips Lester Crest Martin Madrazo Dom Beasley Garage Mechanic Brucie Kibbutz Merryweather Security (if hired) Merryweather Helicopter Pilot (if hired) Merryweather Boat Driver (if hired) Mugger (if hired) Heists Update Lester Crest Agent 14 Karen Daniels Trevor Philips Ron Jakowski Maxim Rashkovsky Avi Schwartzman Paige Harris Lowriders Lamar Davis Gerald Benny Executives and Other Criminals Brendan Darcy Further Adventures in Finance and Felony Assistant Bikers Motorcycle Clubs LJT Malc Sindy Zach Nelson Import/Export Office Mechanic Warehouse Mechanic Gunrunning Agent 14 Chester McCoy Smuggler's Run Ron Jakowski Charlie Reed The Doomsday Heist Lester Crest Agent 14 Phoenicia Rackman Avon Hertz (Formerly) Cliffford (Formerly) Bogdan (Formerly) Agent ULP After Hours Tony Prince Lazlow Jones English Dave Solomun Dixon Tale Of Us The Black Madonna Maude Eccles Paige Harris Simeon Yetarian Yohan Blair Arena War Alan Jerome Bryony Sacha Yetarian The Diamond Casino & Resort Agatha Baker Tom Connors Brucie Kibbutz Tao Cheng Tao Cheng's Translator Avery Duggan (Formerly) Thornton Duggan (Formerly) Vincent The Diamond Casino Heist Lester Crest Georgina Cheng Huang Jimmy De Santa Wendy Heist Crew Members Yung Ancestor (optional) Gerald Los Santos Summer Special Brendan Darcy Solomon Richards The Cayo Perico Heist Miguel Madrazo English Dave Pavel Juan Strickler ( Briefly Briefly While posing as Keinemusik tour manager ) Heist Crew Members (optional) Los Santos Tuners LS Car Meet Sessanta Kenny Dixon Jr. Mimi Hao Brucie Kibbutz The Contract F. Clinton and Partner Franklin Clinton Imani Chop Lamar Davis Dr. Dre DJ Pooh Vernon P The Families Ballas The Criminal Enterprises IAA (Special Agent; Formerly) Agent ULP (Formerly) Agent 14 Ammu-Nation Malc Assistant Lupe Tony Prince Omega Los Santos Drug Wars Ron Jakowski Fooliganz Dax Luchadora Labrat Mutt Downtown Cab Co. San Andreas Mercenaries Los Santos Angels (Team Leader) Charlie Reed Rooster McCraw Pernell Moss Avi Schwartzman The Chop Shop Jamal Amir Yusuf Amir (Buyer) Vincent Effenburger Bottom Dollar Bounties Maude Eccles Jenette Eccles Murph Agents of Sabotage Jodi Marshall Oscar Guzman", "Vehicles": "Player's choice", "Weapons": "Player's choice", "Businesses": "Player's choice", "Label": "Field"}},
{"url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_2_(GBC)", "name": "Protagonists in Grand Theft Auto 2 (Game Boy Color)", "game": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556", "description": "", "attributes": {"Type": "CHARACTER", "Appears in": "Grand Theft Auto 2 (Game Boy Color)", "Voiced by": "None", "Gender": "Player's choice", "Also known as": "Gecko Jumbo Kosai Rooster THC-303 Comrade Grasshopper Kiddo", "Full name": "Character chosen by the player", "Nationality": "Player's choice", "Date of birth": "Not given", "Status": "Alive", "Home": "Avalon , Downtown District Morton , Residential District Tedium , Industrial District , Anywhere City", "Family": "Unknown", "Main affiliations": "The Guider Zaibatsu Corporation Loonies Yakuza SRS Rednecks Russian Mafia Hare Krishna", "Vehicles": "Player's choice", "Weapons": "Player's choice", "Businesses": "Car theft Contract killing Hired driver Drug dealing"}},
{"url": "https://gta.fandom.com/wiki/Stretch_(character)", "name": "Stretch", "game": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556", "description": "", "attributes": {"Label": "Field", "Type": "CHARACTER", "Appears in": "Grand Theft Auto V", "Voiced by": "Hassan Johnson", "Gender": "Male", "Also known as": "Stretch OG Stretch OG Stretch Newspaper articles published after The Third Way Stri-zetch", "Full name": "Harold Joseph", "Nationality": "American", "Date of birth": "Not given", "Place of birth": "Los Santos , San Andreas", "Status": "Deceased [ 1 ]", "Date of death": "2013", "Place of death": "BJ Smith Recreational Center , Chamberlain Hills , Los Santos", "Cause of death": "Beaten or stabbed to death by Michael De Santa during a shootout with the Original Covenant Ballas (Gold medal requirement) .", "Home": "Strawberry , Los Santos", "Family": "Unnamed mother Renatta Sidwell (Ex-girlfriend) Unnamed child", "Main affiliations": "Chamberlain Gangster Families (Formerly) Ballas Franklin Clinton (Formerly) Lamar Davis (Formerly) Demarcus Bradley", "Vehicles": "Felon Jackal", "Weapons": "Pistol", "Businesses": "Drug dealing Gang banging", "Phone Number": "3465550122"}},
{"url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_(1997_game)", "name": "Protagonists in Grand Theft Auto", "game": "Grand Theft Auto V", "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556", "description": "", "attributes": {"Label": "Field", "Type": "CHARACTER", "Appears in": "Grand Theft Auto", "Voiced by": "None", "Gender": "Player's choice", "Also known as": "Note: The dialogues were not changed after the addition of female protagonists. Aruzo Aruzo Used by Sonetti's Right-Hand Man Bubby's baby Bubby's baby Used by the Vercotti Family contact during Gangsta Bang - Phone 2 Monkey Boy Monkey Boy Used by the Vercotti Family contact Pretty boy Pretty boy Used by El Burro Flyboy Flyboy Used by Bryson Rude boy Rude boy Used by Brother Marcus Rankin' bwoy Rankin' bwoy Used by Brother Marcus", "Full name": "Character chosen by the player", "Nationality": "Player's choice", "Date of birth": "Not given", "Status": "Alive", "Home": "Vice City San Andreas ( Formerly ) Liberty City ( Formerly )", "Family": "Unnamed mother Unnamed father", "Main affiliations": "Brother Marcus Brotherhood of Jah Army of Love Samuel Deever (Formerly) El Burro (Formerly) Uncle Fu Uncle Fu's Crime Syndicate Robert \"Bubby\" Seragliano Vercotti Crime Family", "Vehicles": "Player's choice", "Weapons": "Player's choice", "Businesses": "Car theft Contract killing Hired driver Drug dealing"}}
]