[
    {
        "url": "https://leagueoflegends.fandom.com/wiki/League_of_Legends_Wiki",
        "name": "Home",
        "image": null,
        "description": "",
        "attributes": {}
    },
    {
        "url": "https://nfs.fandom.com/wiki/Need_for_Speed:_Unbound",
        "name": "Need for Speed: Unbound",
        "image": "https://static.wikia.nocookie.net/nfs/images/a/a7/NFSUB_Boxart.jpg/revision/latest/scale-to-width-down/268?cb=20221006192511&path-prefix=en",
        "description": "is the thirtieth game in the   and the first since   to be mainly developed by  .\n It was announced on October 6, 2022 by publisher   to be released for PC, PlayStation 5, and Xbox Series X/S on December 2, 2022. A three day early access period for those that pre-order the Palace Edition was also announced, starting on November 29, 2022.\n Starting on November 29, 2022, those with an EA Play subscription can play up to 10 hours of the standard release, and those with an EA Play Pro subscription can play the  . With either subscription. players will gain access to in-game member-only rewards and receive a 10% discount on purchases of EA digital content.\n First announced on June 18, 2020 as part of Electronic Arts' \"EA Play Live June 2020\" presentation, it was shown during a section about the publisher's next generation series of games, targeting the then unreleased PlayStation 5 and Xbox Series X/S hardware.\n An official reveal in June 2020 outlined the yet untitled game was described to \"include a new Need for Speed game that is bringing some astounding visual leaps, developed by the Criterion team, who have launched some of the most highly-rated games in franchise history\". Alongside Criterion, Codemasters Cheshire began assisting in development of the game and the   series as a whole.\n The game's development was pushed back by a year in March 2021, with Criterion pausing development of their   game to assist   and their in-development \"Battlefield 6\", which would later be revealed as  .\n Presented with a unique real-world meets street art aesthetic, the visual style teams the realistic look of the featured cars with customisable graffiti flair featuring energetic visuals, sound effects, nitrous boost, and a new boost element.\n The PlayStation 5 and Xbox Series X releases run in 4K (3840 × 2160) resolution at sixty frames per second whilst the Xbox Series S release runs in 1280p (2276 x 1280) resolution at sixty frames per second.\n The   mode is a single-player campaign taking place in  , a fictional interpretation of Chicago, Illinois, in which the player competes in in-game weekly   for a place in  : Lakeshore's ultimate street racing challenge.\n Unable to stop a robbery at a family auto-shop, two friends are pushed to breaking point, giving the player an opportunity to make their mark on the streets earning rep to go from rookie to top racer by winning the Grand and reclaiming a stolen custom car.\n The player has to take risks to get attention, but they can make their choices; pulling huge drifts, taking on the Lakeshore Police Department, or placing side-bets on rivals. Although the player can choose how they make their mark, the more attention they earn means turning up the heat.\n As part of the player's path, they'll meet A$AP Rocky, the prominent rapper and fashion icon, for a chance to take him on head-to-head as a test of skill and style. Better yet, it's a chance to take his custom   for a drive.\n  is the multiplayer mode and features its own progression separate from the single-player Story mode.\n Up to 16 total players can play together in a free roam session with cross-play , and can form parties of up to 4 total players \n  is the multiplayer progression system for multiplayer and offers rewards as players increase their rank for each volume by completing playlists, daily or weekly challenges, and Linkups.\n  are objective targets associated with the player's progression through single-player and multiplayer, with each challenge having a specific objective, target, and reward.\n Objectives are either Story, Skill, Activity, or Collectible based, and Progress towards objectives can be tied to single-player, multiplayer, or both.\n Rewards include cash, driver poses, Tags, Samples, or cars.\n  include races, eliminators, drift trials, deliveries, and Takeovers. They can be accessed through the various   locations.\n League is a ladder tournament against multiple   in free roam.\n Each rival has a set of objectives leading to a one-one-one playlist for the chance to move up the ladder and unique rewards.\n Linkups are multiplayer co-operative stunt-based free roam events open to all players within a multiplayer session as they appear regularly across Lakeshore.\n Each event requires players to complete 4 successive rounds of challenge phases escalating in difficulty within an establish location boundary and a limited amount of time. Events can appear at any of 7 possible locations across Lakeshore between every four to eight minutes.\n Lockdown is a multiplayer player vs. player vs. environment (PvPvE) loot extraction game mode for up to 15 players split up into multiple crews.\n Players compete against each other for loot and Hot Rides as they avoid the Lakeshore Police Department's crackdown and put their trust in   for their escape.\n Playlists are multiplayer championships in the multiplayer Lakeshore Online mode.\n Each playlist has a unique name to differentiate the included selection of three events as well as the sequence they are ran and the performance tier.\n  are given a performance rating from 100 to 400, which is further split into five performance tiers: B, A, A+, S, and S+.\n Unlocked cars are made available for purchase through a dealership using cash, although unlock requirements for vehicles differs between the campaign and Lakeshore Online, as progression is partitioned between single-player and multiplayer.\n , the visual customisation section for cars, allows players to customise with visual components, wraps, and visual flair with over 10,000 options.\n \n Performance allows players to improve the performance and handling of their cars through upgrades.\n Burst Nitrous allows the player to tap the nitrous button to deliver short and quick injections of increased performance without activating a full nitrous shot.\n Bursts can be earned by getting airtime, grip turning, near missing, drifting, drafting, and taking down racers or cops, but can only be held for a short period of time.\n The   is an avatar players can select to represent themselves in-game as their driver.\n Separate characters can be created for Story mode and Lakeshore Online mode.\n \n  is a fictional interpretation of Chicago, Illinois, and the setting for  .\n It has various districts across the area varying from the urban jungle of Lakeshore City to the mud kicking routes through the Lakeshore Quarry, and the technical Kennedy Test Track to weaving mountain roads nearby.\n The   will engage with anyone participating in illicit street racing using a fleet of units and air support.\n In pursuits, the fleet of units available to the LPD allows for effective response to any increasing requirement of force.\n The soundtrack features songs from various hip-hop and rap artists, including A$AP Rocky and AWGE, as well as an original score by French producer Brodinsky.\n \n Achievements and trophies can be unlocked through gameplay:\n On December 15, 2022, the official   Twitter account announced post-launch updates would start being released by the end of January 2023 , and the first major update focuses on expanding social play features. \n Further replies expanded on later updates including new game modes, features, and cars, alongside experience packs, further social features, progression for Lakeshore Online, expanded customisation content, and hinted at more yet to be disclosed. \n On February 20, 2024, the official   Twitter account announced a second year of post-launch content and updates with four additional volumes launching throughout 2024, dubbed \"Kaizen\" , and also celebrate the 30th anniversary of the   series as well as the inclusion of a premium tack for the  .\n On February 3, 2025, the official   website posted a news article titled \"End of Kaizen Review\".  The post outlines feedback given with regards to the   update, as well as marking the end of post-launch support for  , and announcing the Kaizen team members were joining  the majority of Criterion  as part of the Battlefield Studios collective developing a   in the  .\n  for   comprises of a series of free and paid post-launch content updates including new features, experiences, content drops, and updates to Lakeshore Online.\n  include volumes with large content drops and fixes.\n They can be either client-sided or server-sided through the release of patches or server downtime for maintenance.\n In the \"Settings\" menu under \"Main Menu\":\n In the \"Driving\" menu under \"Main Menu\":\n In the \"Graphics\" menu under \"Main Menu\":\n In the \"Audio\" menu under \"Main Menu\":\n For the PC, PlayStation 5, and Xbox Series X/S releases of the   release:\n For the PC, PlayStation 5, and Xbox Series X/S releases of  :\n An EA Play subscription grants a 10 hour trial of the standard release of  :\n Any progress earned during the 10 hour trial is retained for purchases of the standard or   releases.\n An EA Play Pro subscription grants full access to the   release:\n Leading up to the release of  , a series of announcements, rumours, leaks, and hints of the game came to surface preceding its official reveal on October 6, 2022.",
        "attributes": {
            "Studios": "Criterion Games Codemasters Cheshire",
            "Publisher": "Electronic Arts",
            "Game Engine": "Frostbite (2021-2.3)",
            "Genre": "Racing/Arcade-Action",
            "Game Modes": "Single-player (Offline) Multiplayer (Cross-play optional): Autolog (Asynchronous) Online (2 to 16 players)",
            "Metacritic Score": "77 / 100",
            "Platforms": "PC (Windows 10) PlayStation 5 Xbox Series X/S",
            "PC (EA app)": "December 2, 2022",
            "PC (Epic Games Store)": "December 2, 2022",
            "PC (Steam)": "December 2, 2022",
            "PlayStation 5": "December 2, 2022",
            "Xbox Series X/S": "December 2, 2022",
            "Related Releases": "Need for Speed: Unbound - Palace Edition Need for Speed: Unbound - Ultimate Collection \"Creative Subversion\" kit"
        }
    },
    {
        "url": "https://detroit-become-human.fandom.com/wiki/Detroit:_Become_Human",
        "name": "Detroit: Become Human",
        "image": "https://static.wikia.nocookie.net/detroit-become-human/images/7/72/Detroit_Become_Human_Cover_001.jpg/revision/latest/scale-to-width-down/268?cb=20190320202942",
        "description": "is a cinematic neo-noir thriller game developed by   and published for PlayStation 4, releasing also for Microsoft Windows. The game is the company's 5th title and their fourth interactive drama. It is written and directed by Quantic Dream's founder and co-CEO  . The game itself was released on May 25, 2018 and the Digital Premium Version was released a day before on May 24, 2018 for PlayStation 4. For Microsoft Windows, it was released on December 12, 2019, as an   exclusive. It received a wider release on the   on June 18, 2020.\n \n Set in   during the year  , the city has been revitalized by the invention and introduction of   into everyday life. But when androids start behaving as if they are alive, events begin to spin out of control. Step into the roles of the story’s pivotal three playable characters ( ,  , and  ), each with unique perspectives, motivations and abilities as they face their true selves and question their values. These three androids are present throughout the game as they follow through an emotional journey with choices that must be taken in order for their ultimate 'cause', which can be defined many different ways depending on the values of the player. The plot of the game deals with a variety of mature themes that explore moral ground and each player decision affects what will happen.\n Not every android is included in every chapter. The chapters can be found below, with each containing a flowchart and the technique used to gain 100% completion.\n  is played from a third-person view, which is subject to a set and controllable perspective. The right analogue stick on the DualShock controller is used to interact with objects and observe one's surroundings, the left is for movement, and R2 scans an environment for possible actions; the motion controls and touchpad are also employed. The gameplay is similar to the company's 3rd title  , though similar inputs like prompted   and dialogue decisions are still part of the gameplay. Therefore, the story will branch out depending on which choices are made.\n For action sequences or contextual interactions, players are presented with various symbols, requiring them to either press buttons, move the right analogue stick in a certain way, or shake or tilt the controller. In action sequences, such as when the playable character is being attacked, failure to execute these commands takes the story along a different path, and certain mistakes can lead to a character's death. However, in some cases, a timed sequence plays out before the playable character meets his/her demise. The game presents several routes that players can take. To end the playable character's predicament, players have to find the correct route before the timer at the bottom runs out.  \n All playable characters can die in the course of the story. If a playable character dies, the game does not end, and play control switches to another character, with the events of the previous character's death affecting the story to some extent. Therefore, the story can continue without any of them. (However, the character of Connor can die and be replaced with a new model multiple times, though this impacts his relationships with some characters.)\n \nHigher gameplay difficulties result in shorter duration for players to analyze situations and respond to them. Additionally, making choices early in the game can lock out dialogue and action choices later in the game. A flowchart feature is included every time the player concludes a chapter so that the player is enabled to check out on what they had missed out on. The flowchart could also be accessed by pausing the game. Players can compare the choices they have made with other players with visual percentages labeled next to their designated choices.\n For some major decision points, players will have the ability to rollback to the beginning of the checkpoint to choose a different path. This will not be available all the time.\n Also, levels abound with magazines for players to read, providing backstory to the game universe (these can be re-read at leisure in the   section of the main menu).\n An unusual aspect of the game is that it features a non-playable protagonist, an android named  , who is only encountered in the game's menu, and who undergoes character development of her own as the game progresses.\n  is based on Quantic Dream's 2012 PlayStation 3 technology demonstration \" \", which received strong reactions and an award at the  . David Cage wanted to make the demo into a full game, despite not originally having planned to, because he was curious as to what would happen next. He took inspiration from  's  , which explains that the rate at which human intelligence develops pales in comparison to that of a machine. Therefore, Cage proposes that machines may one day have emotions.\n Androids were designed with reference to artificial organs, how their energy would be generated, and human eye movement. An android's abilities were determined by each of their given profession. Experts in artificial intelligence were consulted to discern which technological advancements were the most feasible.\n Detroit was chosen as the setting to revitalize a city that had succumbed to economic decline after a historical contribution to American industry. The developers traveled to Detroit to conduct field research, taking pictures, visiting abandoned buildings, and meeting people.\n In late 2013, Cage was in preproduction on  , which he said would build upon his work on   and  . Cage's script – between 2,000 and 3,000 pages – was first relayed to the design team while programmers created the graphics as well as a new game engine with advancements in features like rendering, dynamic lighting, shading, bokeh, and physical cameras. In October 2016, the screenplay was completed after more than two years. Writer Adam Williams was hired to help finish and flesh out the story. Cage used charts and diagrams to see where the choices would end up; penning \"five or six thousand pages of notes\".\n The casting extended to Los Angeles, London, and Paris in search for more than 250 actors to portray 513 roles. The actors were scanned in 3D, whose models were then made into characters. Shooting and animation followed, and on 8 September 2017, the performance capture was finished after 324 days.\n Director of photography   used \"thick grain and shaky long lens\" with shallow depth of field for Kara, \"small, tight grain\" and a blue palette for Connor, and orange and white colors for Markus. The game was released to manufacturing on April 23, 2018, after four years of production.\n  was announced on 27 October 2015 at a Sony press conference during  . It appeared at   and  , showing trailers of additional playable characters and gameplay. Following E3 2017, Cage confirmed that the game would be released in 2018, later specified as the first or second quarter therein. The game was released on May 25, 2018 for PlayStation 4.\n In 2017, again at a Sony press conference during Paris Games Week, a new trailer featuring Kara and gameplay was shown. A demo of the first scene, \"The Hostage\", was made available on the   on April 24, 2018, accompanied by an   skill that guides the player through the demo. The game was promoted in Japan with the live action short film,  . This was followed by a launch trailer and two animated English-language shorts introducing Elijah Kamski, the creator of the androids, and Chloe, the first android to pass the  . If pre-ordered,   would come with a dynamic theme and digital soundtrack. The soundtrack was available for streaming on June 22, 2018.\n On December 4, 2018, the standard edition of  ,   and   were released as the  \n On March 20, 2019, it was announced that   would be released for Microsoft Windows along with   and  . It will be self-published by Quantic Dream and sold exclusively on the Epic Games Store for a year before appearing elsewhere. Pre-orders for the Epic Games Store release of   opened in November 2019, with the game slated for a December 12 release.\n On May 25, 2020, the demos of all three games became available on  . Quantic Dream announced that the full games would be available on Steam on June 18, 2020.\n   \n Three different composers ( ,  , and  ) worked on this game and composed a unique soundtrack for each playable character.\n   \n The Digital Deluxe Edition of   became available for purchase on May 24, 2018. It includes the following:\n  received \"generally favorable reviews\", according to review aggregator Metacritic.   Chris Carter said that, despite tiring of Quantic Dream's penchant for detective stories, he enjoyed its execution and Connor's \"calm demeanor and android origin\". Carter praised the setting, calling it \"believable\" and \"captivating\", while also noting that the \"smaller moments\" were among its strengths. Michael Goroff of   favored the fact that the playable characters were androids because their second-class citizenship status created an \"effective viewpoint\". The controls and quick-time events were also subject to approval. Goroff lauded the \"incredibly satisfying and sometimes unexpected\" impact of the collective decisions and declared this the game's \"biggest accomplishment\". Writing for  , Kimberley Wallace agreed with Carter's assessment of the \"little moments\" and said the character development was \"fun to watch\", well-handled, and the \"highlight of the game\". She appreciated how the branching narratives affected the latter parts and complimented Quantic Dream for the \"impressive\" achievement. Paul Tamburro at   wrote that   boasted a \"compelling world ... enriched by fantastic performances and state-of-the-art motion-capturing\". He commended Curry, Dechart, and Williams for their \"engrossing performances\" and said the game was among \"the most well-acted\" around. He also felt the choices \"drastically\" changed the story.\n Peter Brown of   welcomed the variety of cycling between characters for ensuring player engagement. The game's \"most dreadful and horrific scenes\" made a considerable impression on Brown, some of which he found to be \"truly unforgettable\". Additionally, he remarked that the visuals were beautiful and \"captivating to behold\".   Andy Hartup praised Quantic Dream for making \"an interactive story capable of provoking genuine, honest, and varied emotions\". He thought the consequences of the decisions were \"utterly delightful\", albeit rarely, and saw the setting as \"beautiful\". Hartup liked the character models, calling them \"the most remarkable you’ll see in gaming\", and favoured the eyes in particular. On the decision-making aspects, he proclaimed   \"the new gold standard ... for meaningful choice in gaming\". Lucy O'Brien at   wrote that the game \"manages to be a frequently moving melodrama that bends to your choices with meaningful results\". She also praised the acting of Curry, Dechart, and Williams, observing different benefits to each character. O'Brien appraised the general plot as \"big, ambitious fun\" and the environments as \"beautifully detailed\". Like Goroff, Wallace, Tamburro, and Hartup, O'Brien found the \"branching paths to be multiple and deep\", while also complimenting the flowcharts, a feature Colm Ahern of   singled out as one of the game's few redeeming qualities.\n Conversely, Carter criticised the game's \"surface level exploration\" of the  , questioning the director's subtlety. He blamed the weakness of Kara's story on Cage's writing, called the portrayal of domestic and substance abusers \"cartoonish\", and complained about occasional \"wooden acting\". Goroff's only annoyance with the controls concerned its motion-sensitive feature, especially disparaging its use in quick-time events. Wallace thought Markus' story was the worst of the three, citing \"predictable speeches\" and \"black-and-white decisions\" as the primary problems. She suggested that the narrative suffered \"heavy-handed\" attempts at historical parallels, and noted, as Carter did, that its representation of abuse seemed \"exploitive due to the over-the-top antics\". She felt the use of the motion controls and touchpad was \"unintuitive\" and wanted more variety from the gameplay. Tamburro faulted the opening act for its \"slow\" and \"dull\" interactions, the quick-time events for their abundance, and occasional story paths for being \"highly questionable\". Brown viewed Markus as \"remarkably lacking in nuance\" and the allegories to actual history as \"on-the-nose\" and \"distracting\". He commented that the flowchart exposition was \"ultimately detrimental\" to player immersion and wished there was a way of disabling it. Hartup disliked the moments in which themes were either \"fumble[d]\" or \"pushed too far\". O'Brien observed multiple plotholes and found a considerable amount of \"clumsy\" exposition and dialogue. Ahern wrote in his verdict, \"  wants to move you ... The thing is, it really doesn't ... when the narrative is as cringey and ham-fisted as it is you won't want to play through it multiple times\".\n  reached fifth place on the UK chart after two days of release. In its first week, the game topped both the overall sales and console sales charts. Though it sold fewer copies than   and   in that region, Cage and executive producer Guillaume de Fondaumière claimed   was the studio's most successful launch yet.\n  later confirmed it had a sales growth in excess of twenty percent over  . It was the third best-selling video game overall, generating the third-most revenue in the US, and sold the most out of any title on the PlayStation Store in May 2018, having been available for six days.\n The game released in Japan with 39,548 units (which rose to 56,480 after two weeks), second to  . In the UK, the second week also saw it become the second best-selling video game (behind  ). The game sold one million copies after the first two weeks. For the week ending 10 June, its physical sales fell to fourth place in the UK. Its Japanese sales hit 74,458 copies on 17 June, but dropped from the country's console chart one week later, when the game was placed ninth on the UK individual formats chart. Two months after release, a total of 1.5 million people had played the game.\n The game became Quantic Dream's the fastest selling game and by that December, it had sold more than 2 million copies, approaching 3 million the following month. In October 2019, worldwide sales had reached 3.2 million copies on PlayStation 4. A press release from Quantic Dream reported in August 2020 that it had sold over five million copies across all platforms.\n The chapter by chapter text transcription of the game made by an anonymous fan is featured here:  \n The analysis of every technology in the game compared to real technologies made by anonymous fans is featured here:  \n  won the award for \"Best of E3\" at   Best of E3 Awards, and was nominated for \"Best PlayStation 4 Game\" and \"Best Adventure Game\" at   Best of E3 Awards, and for \"Adventure Game\" at   Best of E3 Awards.\n See also  .",
        "attributes": {
            "Developer": "Quantic Dream",
            "Publisher": "Sony Interactive Entertainment Quantic Dream (Microsoft Windows)",
            "Director": "David Cage Benjamin Diebling",
            "Producer": "Guillaume de Fondaumière Jason Stewart Sophie Buhl",
            "Writer": "David Cage Adam Williams",
            "Platform": "PlayStation 4 Microsoft Windows",
            "Release Date": "May 25, 2018 (PlayStation 4) December 12, 2019 (Microsoft Windows - Epic Games Store) June 18, 2020 (Steam Store)"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/Grand_Theft_Auto_V",
        "name": "Grand Theft Auto V",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/7/76/CoverArt-GTAV.png/revision/latest/scale-to-width-down/268?cb=20250708181846",
        "description": "(also known as  ,  ,  , and  ) is a video game developed by  . It is the fifteenth installment in the   series and the fifth game title in the   of the series.\n The original edition was released on September 17,  , for the   and  . The   and   \"enhanced\" versions were released on November 18,  , and was later released on April 14,  , for the  . A further \"expanded and enhanced\" version for the   and   released on March 15,  .  It was made available for the PC on March 4,  .\n Optionally, players are also able to purchase access to   as an add-on for the standalone versions of  .\n As one of the most eagerly-awaited video game titles to be released in 2013, the game was widely anticipated prior to its release.   was released to universal acclaim, holding scores of 96 and above on Metacritic and GameRankings, as well as receiving perfect scores from over 30 reviewers. It sold 11,210,000 copies and grossed $800,000,000 on the first day of release, setting many records, eventually making $1,000,000,000 within 3 days of the game's release.\n As of May 2025,   is the second best selling game of all time, with over 215 million copies sold.\n The original edition was officially announced on October 25,  ; the game's first trailer  was released on November 2, 2011. The game was initially slated for a Spring 2013 release and there were even posters printed saying this but was actually released in the northern hemisphere Fall the same year. On July 15, 2013, Rockstar announced the Japanese release date for the game would be October 10, 2013, which ended up being almost a month after it was released in the Western world.  The \"Enhanced\" edition for PlayStation 4, Xbox One and Personal Computer was announced on June 9, 2014, with pre-orders made available on June 10, 2014. An \"expanded and enhanced\" version for PlayStation 5 and Xbox Series X|S was initially announced for \"late  \" on June 11,   and a firm release date of March 15, 2022 was announced on May 19, 2021.\n The game takes place in the year   in the southern part of the state of  , more precisely in the city of   and rural areas of  , and tells the stories of three  :  ,  , and   — three uniquely-different criminals as they commit daring and (usually) profitable heists across the sprawling city of Los Santos. \n It takes place about five years after the events of  , and eight years before the events of   update of  .\n Nine years after a failed robbery in the fictional town of  ,  , former bank robber Michael Townley and his family have relocated to Los Santos under a new identity. Michael is living a normal but stale life, until he encounters Franklin Clinton, a gangster who seeks to elevate himself in the Los Santos underworld, and unexpectedly encounters Trevor Philips, the only other survivor of the bank robbery in Ludendorff. The three join forces to carry out a daring task to rob the   and seize tens of millions of dollars worth of gold. However, the trio find themselves being taken advantage of by corrupt Feds, using the three to carry out their own agenda, as well as numerous confrontations with rival gangs and other criminals.\n  is a standalone multiplayer game title, considered a separate game by Rockstar, that is included for free with the retail copy of   for PlayStation 4, Xbox One, PC, PlayStation 5, and Xbox Series X|S. In  , the player will have the freedom to explore alone or with friends, work cooperatively (PvE) to complete  , band together to participate in activities and ambient events, or compete (PvP) in traditional game modes and in   with the entire community. Initially, the online game shared the same   map as  . This was later expanded to include the island of  . The game shares some   and mechanics originally from  .\n In  ,   from   can be carried over to  .   has multiplayer features linked to  . Sessions could accommodate up to sixteen people on the former PlayStation 3 and Xbox 360 version, and thirty players on the current PlayStation 4, Xbox One and PC versions.\n A completely standalone version of   was released on March 15, 2022, and made exclusively free on PlayStation 5 for the first three months. Optionally, access to   must be purchased separately as an add-on to the game.\n GTA V' \n DLC have been released regularly since the launch of   and  , adding new vehicles, weapons and other content. They are however more advanced in GTA Online with the availability of jobs and properties along with additional character customization options like tattoos, clothing, masks, hairstyles etc.\n Additional content is unlocked if the player buys the Collector's Edition of  . It features a  ,  ,  ,   and a  . This is available when the Collector's Edition is installed.\n All subsequent content updates focus on  , and no content has been implemented in   in updates that followed the   update.\n On November 3, 2011,   confirmed that the game would take place in   and the surrounding countryside - and will not feature a recreated rendition of an entire   - in a statement on their Newswire:\n During the     cover story, the vice president of creativity for  ,  , has stated that Los Santos this time around is different and a lot more developed (having cities, wilderness, deserts, farmlands, towns, a  , a   and a   (including coral beds). The state of   is also about five times larger than  ,  , and  . After some calculations by members of  , that would equal to around 27.5 square miles/71.2 km  when land and sea are put together. \n  features three playable protagonists:  ,   and  .\n Michael is a retired professional bank robber, who after making a sweet deal with the  , is forced out of retirement back into the life of crime. \n Trevor is the loose cannon in this story and is also the long time best friend of Michael and a hothead psychopath as well. \n Lastly Franklin, a younger gangbanger and repossession agent who has a large amount of experience behind the wheel, who meets Michael while repoing his car.\n Other main characters include  , Michael's wife;   and  , Michael's two grown-up children;  , Franklin's closest friend;  , Trevor's paranoid friend; and  , a long-time associate of Michael and Trevor.\n Although it is not specifically stated when exactly in 2013 the game takes place, the following evidence suggests August - October 2013:\n Prior to the   of the eighth generation consoles and PC versions, there was wide speculation and anticipation regarding an official announcement from Rockstar. On change.org, there was a petition with 728,000+ signatures asking for a PC version at the time of the announcement. Within the comments section of the Rockstar Newswire, and many other GTA related blogs, there were many comments asking for a PC/Next Gen release. After its reveal at E3 2014, the news spread like wildfire and became one of the most talked-about announcements.\n The enhanced version of   was released on November 18, 2014, for the PS4 and Xbox One and was released for PC on April 14, 2015. With the release, there are many improvements and changes compared to the versions released on PlayStation 3 and Xbox 360. No major graphical changes from PS4 and Xbox One are seen in the PC version, other than further Draw Distance and 4K capable quality. The PC version also features 2 exclusive radio stations:   (now available for all consoles from the   update) and  .\n The biggest new feature was a  , which is not only available in vehicles but is also for the first time available on foot. Several other features were added. These include (see   for more information):\n These are all the hobbies and pastimes listed on the   page; note that they are not all mandatory to achieve 100% completion in the game.\n  was developed by   in collaboration with most other Rockstar studios around the world.\n Rockstar North began to develop   in  , around  's release.  Development was conducted by a team of more than 1,000 people from studios around the world. The proprietary   (RAGE) was overhauled for the game to improve its draw distance rendering capabilities. The Euphoria and Bullet software handle additional animation and rendering tasks.  Having become familiar with the   and   hardware over time, Rockstar found they were able to push the consoles' graphical capabilities further than in previous games.  Analyst estimations place the game's combined development and marketing budget at more than £170 million (US$265 million), which would make it the most expensive game ever made at that time. \n The open world was modelled on Southern California and Los Angeles, and its design and in-game render constituted much of the game's early work.  Key members of the game world production team took field research trips throughout the region and documented their research with photo and video footage.  Google Maps projections of Los Angeles were used by the team to help design Los Santos' road networks.  To reflect and reproduce Los Angeles' demographic spread, the developers studied census data and watched documentaries about the city. The team considered creating the open world the most technically demanding aspect of the game's production. \n A fundamental design goal from the outset was to innovate on the series core structure by giving players control of three lead protagonists instead of one.  The idea was first raised during Grand Theft Auto: San Andreas' development, but contemporaneous hardware restrictions made it infeasible.  Having developed two   episodic expansion packs featuring new protagonists in  , the team wanted to base   around three simultaneously controlled protagonists. The team viewed it as a spiritual successor to many of their previous games (such as  ,   and  ), and designed it to improve upon their gameplay mechanics.  They sought to improve the action gameplay by refining the shooting mechanics and cover system  and reworked the driving mechanics to correct  's awkward vehicle controls.\n After an audition process,  ,   and   were selected to portray Michael, Franklin and Trevor, respectively.  Their performances were mostly recorded using motion capture technology , but dialogue for scenes with characters seated in vehicles was recorded in studios instead.  The game features an   composed by a team of producers collaborating over several years.  Licensed music provided by an in-game radio is also used.  The team licensed more than 241 tracks shared between fifteen radio stations, with an additional two stations providing talk radio. Some of the tracks were written specifically for the game, such as rapper and producer  ' original work composed for the   radio station he hosts. \n  evolves nearly every mechanic that was in the previous   games. As far as driving goes, the vehicles have been greatly improved, with Rockstar running more complex physics on them, such as making some cars hold to the ground slightly better. The driving mechanics feel more like a racing game, particularly the   series, compared to  's rocky, boat-like handling system. The shooting mechanics are better in terms of the feel of the mechanics and larger compared to the melee mechanics in the game, that being said, melee has been improved over the previous titles as well. Weapon selection has now also been changed. Instead of the old way of selecting through all the weapons sequentially, there is now a  , which is similar to the one featured in  , another game made by Rockstar Games.   draws inspirations from many different Rockstar titles in the past, including  ,  ,  , and  .\n There are many unique features in the game; one being that when the players are playing as one of three protagonists in the game, the other two are living their independent daily lives, and the player may be surprised by what they find the characters doing when they switch back into them. Another unique feature is that the   is executed in a  -styled manner and was displayed during a   demo, which was shown to have run smoothly and without lag. The  ,   and   versions present an exclusive feature, the  , where the whole game can be played through the eyes of the protagonist. This gameplay mode presents a whole new way to play the game. Cars have detailed   different from one another; shooting is like that of a dedicated FPS game.\n New activities have been added, such as  ,  , jet skiing,  ,  ,  , and  .   have also been added to the game and can appear anytime as the player explores around the map. The   has returned from   and is used for calling the player's contacts, surfing the web, and quick saving. Giving people the middle finger is another new feature the player can use while in a vehicle. Rockstar recommended that the player do this in various locations around Los Santos to see the outcome; depending on where the player is at, they will get varied reactions from pedestrians.\n Rockstar has also made changes to the pedestrian mechanics; some pedestrians can be seen at the bus stops in  , and the same people can reappear in   working in the gardens of the opulent mansions. Some minor mechanics that help convey the environment and appearance of Los Santos occur at certain times of day, such as a sprinkler system being turned on in the morning in wealthy areas like  .\n  has more vehicles than in any other   game to date, with a variety of vehicles, including aeroplanes, helicopters, cars, utility vehicles, emergency service vehicles, motorcycles, and jet skis. Players are able to fly planes, which was a cut feature from   because of the limited size of the map, but the feature is now available in   because of the much larger, open world map. There are also   that players are able to use to explore the depths of the  . The   from previous   titles has returned, including a new complex aiming system and a realistic depiction of a tank. A new feature also allows the player to roll-over a vehicle when the car is flipped upside down.\n Like all previous games, a wide array of vehicles spawn driving around the map that can be stolen. To give the game a sense of realism and make the map feel more alive, various vehicles (as well as pedestrians) spawn in   to make them more interactive with the map, such as delivery vans pulling out of alleyways, emergency vehicles responding, or vehicles pulling in and out of driveways. This behaviour was present in   to a lesser extent and is revamped in  , even more so with the enhanced release of the game, where modified vehicles can spawn driving around, as well as the presence of the fully-controllable  , among other planes flying high above  .\n Businesses from   re-appear. New businesses also appear, such as the   pest control company, who specialise in fumigation and the fast-food restaurant,  . The option to eat takeaway food from outlets such as   is no longer available. Instead, the player can only buy drinks from the various   across the map.\n The game features a large variety of weapons, including assault rifles, machine guns, handguns, shotguns, sniper rifles and rocket launchers. There is now the option to mount   onto various different guns, each one affecting the performance. Melee weapons like the   and the   that weren't present in   have also been introduced to  .\n In the game, the player has the option to customize the three protagonists' wardrobe and appearance. There is less customisation available compared to that of   (e.g. changing the body mass of the 3 characters isn't available as it was with Carl Johnson in San Andreas). The availability of tattoo parlours, barber shops and the ability to apply and remove facial hair has returned from   after being missing from previous titles in the  .\n Upon release,   received overwhelmingly universal acclaim and commercial blockbuster worldwide. Critics enjoyed the multiple lead character formula, heist mission design and presentation, while some critics weren't fond of the story and characters.\n  awarded the game with 97/100, making it the second highest rated   game in the series and the 11th highest rated game of all time.\n  awarded the game with a 97/100, they considered it as a \"generation-defining\" and \"exceptional\"   game in the series.\n  awarded the game with 40/40, making it the second western-developed game to received a perfect score from  .\n  awarded the game with a perfect 10/10, Keza MacDonald of IGN called   in his review as \"one of the very best video games ever made\".\n  awarded the game with a prefect 10/10,  they wrote in their review that   is a \"remarkable achievement\" in open-world design and storytelling.\n awarded the game with a near perfect 9.75/10, Matt Bertz really enjoyed the combat in  , noteing that players are kept \"in the thick of the action\" during shootouts.\n  awarded the game with 9/10, Tom Bramwell of Eurogamer wasn't keen on the protagonists (more particularly Trevor) as he found him as \"shallow and unconvincing\", and felt that his eccentricities hurt the narrative and overshadowed Michael and Franklin's character development.\n  awarded the game with 9/10, former   employee Jeff Gerstmann considered the heist missions a welcome deviation from series typical mission structure and Carolyn Petit of   cited the 1995 film   as a stylistic influence on the heists mission design.\n  awarded the game with a perfect 5 stars out of 5, Hollander Cooper of   said in his review that the story and the characters was the weakest part of the game, as he thought the game negated inconsistencies in the story of previous entries, whose single lead protagonists had muddled morality.\n  awarded the game with a near perfect 4.5 stars out of 5.\n  were the least fond towards  , awarding the game with a 3.5 stars out of 5, Greg Tito had difficulty connecting with the characters' emotions since they acted out of greed with no sense of morality and thus gave players little reason to support them.\n In 2014, WatchMojo placed   at the #2 spot in their \"Top 10 Grand Theft Auto Games\" list countdown, and at the #3 spot in their \"Every Grand Theft Auto Game Ranked\" video over on their sister channel MojoPlays in 2021.\n  has sold over 205 million copies as of 2024, making it the best selling   game in the series and the   of all time.\n Like all previous   games,   has courted controversy, though has been viewed by some as significantly more controversial than its predecessors.\n A   which requires the   to torture a   for the   has proven significantly controversial. The mission contains water-boarding, using a wrench on kneecaps and genitals, electrocution, and even an action where the player can perform tooth extraction using pliers.\n Both   and   received criticism. One part was missions, as only three made the player profit, and only one of them topped $1,000,000. Missions were longer, more taxing and low to non-paying. Only seven non-heist missions gave a payout;   gave the player $250,   gave the player $62,000 and   gave the player varying amounts of between $3,000 and $10,000. The   version of   was also criticized for the lack of an adequate anti-cheat with modders becoming prevalent in   and being dealt with very little, in addition to  ' lack of efficiency in dealing with an ongoing modder problem and banning legitimate, non-cheating players instead. \n The ongoing success and continued development of  , which resulted in the game being the first to span three generations of game consoles without a subsequent   title being released, has been a common complaint for those anticipating announcement of a possible  , until the announcement of   on February 4th 2022.\n After the game was released, actress   claimed that Rockstar had used her likeness without permission for in-game celebrity  , which Rockstar denied.  On 1 September 2016, Lohan's lawsuit was dismissed. \n In October 2013   claimed Rockstar used two songs from   without permission, the songs in question being \"C-Walk\" by Kurupt and \"Nothin' But the Cavi Hit\" by Tha Dogg Pound and Mack 10. However, Dillinger was not signed to Death Row at the time and had an ongoing feud with Kurupt. The lawsuit was eventually dropped and the songs stayed in the game. \n On September 17, 2022  a user known as 'teapotuberhacker' has illegally obtained access to Rockstar's Slack channel  and their internal Perforce Helix Core server , and stole, respectively, developer footage of   and an unknown amount of development assets, documents, and the source code of  ; the former of which have been published by the hacker on  . Although the hacker has published snippets of the   source code on GTAForums, no files have been publicly leaked at that time. \n On November 15, 2022, a user on GitHub known as 'gta-source'  published a repository of 53 files from the source code leak, primarily related to the documentation of the game's  . The repository has been taken down a day later following a DMCA notice by  . \n On November 19, 2023, an executable alongside its corresponding .pdb (program database) file was leaked in a Discord server.  This file originated from the files stolen in September 2022  and has later been removed from the server after the files have began to be publicly reposted.\n On December 24, 2023, over 16GB of internal source code was leaked online.  The archive contained leaked source code for the game itself as well as  , source script files, and hundreds of studio tools. The leak was considered to be one of the most substantial gaming leaks, alongside  . \n The next day, an archive containing 14GB of various art assets, documents, and developer tutorial videos was leaked.  Like the source code leak, this has also been a part of the September 2022 breach. \n As with the   leaks, Take-Two Interactive issued a takedown notice on any redistribution of the source code, including hyperlinks to third-party websites redistributing the leak and guides to compile a working copy of the game.    did not acknowledge the leaks.\n An early prototype of   downloadable content (DLC) packs was accidently left unsecured on Xbox Live Arcade's PartnerNET, an internal   platform that allowed developers to access and test upcoming downloadable content and titles. This incident occurred on July 13, 2013, just prior to the release of  .  Although initially ruled as fake, the files reemerged on October 21st, 2024.  The leak primarily featured  , along with an initial version of the  .  \nEach weapon was packaged separately, and with the exception of the Atomic Blimp DLC  and   DLC , they employed an older coding structure akin to that of  , necessitating manual adjustments for functionality. The other prototype DLC packs included:\n The idea was later turned into   bonus.",
        "attributes": {
            "Type": "GAME",
            "Developer(s)": "Rockstar North",
            "Publisher(s)": "Rockstar Games",
            "Producer(s)": "Leslie Benzies Imran Sarwar",
            "Writer(s)": "Dan Houser Rupert Humphries Michael Unsworth",
            "Composer(s)": "Tangerine Dream Woody Jackson The Alchemist Oh No DJ Shadow",
            "Platform(s)": "PlayStation 3 PlayStation 4 PlayStation 5 Xbox 360 Xbox One Xbox Series X|S PC",
            "PlayStation 3": "September 17 2013 September 17 2013 September 17 2013 October 10 2013 July 17 2025",
            "Xbox 360": "September 17 2013 September 17 2013 September 17 2013 October 10 2013 July 17 2025",
            "PlayStation 4": "November 18 2014 November 18 2014 November 18 2014 December 11 2014 July 17 2025",
            "Xbox One": "November 18 2014 November 18 2014 November 18 2014 December 11 2014 July 17 2025",
            "PC": "April 14 2015 July 17 2025",
            "PlayStation 5": "March 15, 2022 July 17 2025",
            "Xbox Series X/S": "March 15, 2022 July 17 2025",
            "Engine": "RAGE",
            "Supported Languages": "English French Italian German Spanish Japanese Russian Polish Brazilian Portuguese Traditional Chinese Simplified Chinese [ EV / E&E ] Latin American Spanish Korean",
            "Protagonist(s)": "Michael De Santa Franklin Clinton Trevor Philips",
            "Location(s)": "State of San Andreas Los Santos County Blaine County State of North Yankton Ludendorff (briefly) (briefly) Appears in Prologue, Bury the Hatchet and End Credits only",
            "Timeline": "2013 (Main Events) 2004 ( Prologue )",
            "Universe": "HD Universe",
            "Preceded by": "Grand Theft Auto: Chinatown Wars (March 17, 2009) Grand Theft Auto Online (October 1, 2013) Grand Theft Auto VI (May 26, 2026; scheduled release)",
            "Label": "Field"
        }
    },
    {
        "url": "https://reddead.fandom.com/wiki/Red_Dead_Redemption_2",
        "name": "Red Dead Redemption 2",
        "image": "https://static.wikia.nocookie.net/reddeadredemption/images/0/0a/Reddeadcover.jpg/revision/latest/scale-to-width-down/268?cb=20180503145113",
        "description": "(stylized as  ) is a western-themed action-adventure video game developed and published by  . It is the third entry in the   series and a prequel to 2010's   and was released on October 26th, 2018  on PlayStation 4, Xbox One  and on November 5th, 2019 for PC.\n Set in a fictional recreation of the American Old West in 1899,   focuses on the life of   and his position in the notorious  . The game follows the gang's decline as they are pursued by lawmen, fellow gangs and   agents. The narrative revolves around the characters of  ,   (both of whom appeared in  ) and   in addition to Morgan.\n  is set in an open world consisting of five American regions, which the player can explore as they proceed with the story, and can be played through both third-person and first-person view. As Arthur Morgan, players can interact with the game world in several ways, including story missions, side quests, challenges, randomized events, and hunting. An   system, returning from the previous game, changes accordingly to the player's actions towards non-player characters.\n Upon release,   received widespread universal acclaim; it was praised for its writing, themes, characterization, open-world design, visuals, realistic elements and attention to detail, though it also received criticism for its control scheme and the effect of realism on the gameplay. A commercial success,   had the second-biggest launch in the history of entertainment (behind fellow Rockstar Games title  ), generating $725 million in sales from its opening weekend and shipping over 23 million copies in retail.\n  is a western action-adventure game set in an open world environment and played from a third-person perspective, featuring single-player and online multiplayer components.  The game has new features absent from the previous game. For example, new mechanics such as using a   and arrow, dual-wielding revolvers, wading in water and using a canoe have all been introduced. Wildlife and hunting in the game have also improved.\n The game focuses heavily on player choice for the story and missions. During  s First Look preview on the topic of how player choices can affect interactions and missions, Rob Nelson, Co-Studio Head at Rockstar North said:  \n Players can communicate with any NPC in ways much different from previous Rockstar games. They can choose options such as having a friendly chat, having a threatening chat in order to steal money from the NPC, or they can simply take out that character and loot the corpse.\n In a further expansion of immersion, players need to take care of their equipment, such as their weapons, by cleaning them. In terms of character customization, players have the option of visiting a barber for a cut and style; however, the styles available to players depends on how much they have let their character's hair naturally grow over the course of the game.  Characters will have different sets of clothes for different weather conditions, have to regularly eat and bathe, and actions that were once more automatic have been greatly expanded upon in detail, including skinning a kill and examining objects. \n  and   are essential skills for survival in the wilderness, providing food, materials, and a source of income. A huge variety of fish swim the many rivers, lakes, and streams, and selecting the right bait or lure is key to a successful day's haul. Tracking an animal takes focus and patience; move carefully and watch the wind direction or players will alert their prey. The choice of weapon and shot placement is also very important and will affect the quality of the meat and pelt, which in turn affects the price that traders will pay for them. Players need to make sure to pick the right gauge of rifle for the size of the animal that they are hunting, or master the use of the bow for a quiet and clean kill. If prey is injured, they will try to escape, forcing players to continue pursuing them.\n After a successful hunt, players can either skin and butcher the animal on the spot or take it with them whole. Animal skins and carcasses will rot over time if not properly tended to, and this both decreases their value while making them stink, and makes the character a target for wild animals when out of town.  Skins, parts, meat, and entire carcasses can all be loaded onto horses to be sold to the butchers or at the general store in town, taken back to camp for the stew pot, or crafted into clothing or other items. Trappers can craft more exotic goods for players.\n Unlike previous Rockstar games,   features hair that grows. Over time, Arthur's hair and beard will grow longer. Should the player wish to remove Arthur's beard, his beard can be either trimmed or completely shaved off at camp. If players decide they want to cut off his hair, they'll have to visit a barbershop, where the barber will cut their hair/facial hair, or style it professionally in ways Arthur can't do at camp. No hair can be \"added\" at barbershops in the same way as in previous games, or in real life. For example, if the player decides to shave off Arthur's beard, he will not be able to select a styled beard with a curled mustache.\n In addition, Arthur can also bathe. This isn't necessary, but if the player is covered in mud or blood, NPCs will comment on Arthur's smell or appearance. If Arthur doesn’t bathe for an extended amount of time,   will forcibly make him wash at camp. Furthermore, Arthur needs to sleep and keep himself healthy, otherwise, he'll feel tired and drained of energy. If Arthur is underweight, his stamina will diminish more slowly, but his health will drain more quickly. If overweight, his health will deplete more slowly while his stamina will diminish at a faster rate. Arthur's weight is best when it's at a perfect or moderate level.\n While Arthur is sick, his cores will be reduced by a fixed percentage and he will only be able to eat a limited amount of food. Arthur will only get the benefits he needs by sleeping. If Arthur eats too much while he is sick, he will start coughing immediately afterward.\n After completing the mission \" \" the player will be able to play as John.\n Over time, John's hair and beard will also grow longer. Should the player wish to remove John's beard, it can be either trimmed or completely shaved off in the bathroom at    or    . If the player wants his hair styled professionally, they must go to a barbershop. If the player wishes to style long hair, they must grow out John's hair/beard. Players may find John's scars to be visible if his facial hair is short.\n John can also bathe. This may be just something the player can do, or serve as a function. If John is dirty and has not bathed in a while, other civilians will make comments on his smell. John needs to sleep and keep himself healthy, otherwise, he will feel tired and drained of energy.\n John's weight is also a big part of maintaining his health. If his weight is average his stamina and health will not be affected. If John is underweight, he will have less health but more stamina; while if he is overweight he will have more health but less stamina.\n Development of   began in 2010 as production drew to a close on its predecessor,  .  It is unclear exactly when development started, some sites like   state that development began in early 2011  while others like   claim that development started in 2010. \n In early 2011, Dan Houser, co-founder of   and head writer for the company, began talking to   about a potential follow-up to the first  . When Dan Houser was interviewed by Vulture, he said that by late summer of 2011, he had a \"broad outline and rough flow of the game defined\". By Autumn 2012, many of the game's missions started to shape up, although the scripts for the missions were very rough at the time and weren't completed.\n It was at this time that read-throughs of the scripts commenced, this was done via video conference calls with directors of gameplay, art design, and animation from Rockstar offices around the world.\n The final script for  's main story is approximately 2000 pages long. However, with the addition side-content and additional dialogue, Dan Houser estimates that if the pages were stacked, they \"would be eight feet high\". In cohesion with the script, vast efforts were made to further bring it to life by spending a total of 2200 days on the motion-capture work. This also required vast amounts of actors; a total of 1200 actors were involved in the motion-capture sessions, 700 of them with dialogue. \n The first motion-capture sessions commenced in 2013 at Rockstar’s motion capture studio in Bethpage, New York. The majority of the sessions were directed by Edge.\n Later in 2015 the renowned composer Woody Jackson was brought in to compose the game's music. \"We have 192 interactive mission scores, and we thought about the music constantly from the time we brought in [composer] Woody Jackson in 2015\", says Ivan Pavlovich, Rockstar’s music supervisor.\n By mid-2017, the acting for  's story was completed. At this time, the story was approximately 65 hours long, but a 5-hour portion of the game's story was later cut from the game. At one point, the protagonist Arthur Morgan had two love interests, but Dan Houser said: \"we decided one of them didn’t work\", and scrapped the idea as a result. In fact, whole missions were removed, with the reason being as follows: “they were never going to work technically or be quite slick enough, or they felt superfluous. We removed a mission on a train where you had to deal with bounty hunters, because it was fun at first, but then it wasn’t. This part of the process is always about compromise and horse trading. Everyone always loses bits of the game they love”.\n Under 2017 and much of 2018, the game was polished and tested to its full extent. In 2017, work was also started on the online-counterpart of the game:  . Story segments were assembled and additional motion-capture work was done.\n It is unknown exactly how many were involved in the development of the game. According to Rockstar's open \"Thank You\"-letter, a total of 3168 individuals are credited for their involvement in the game. \nHowever, this does not include any of the 1200 actors, thus the exact figure can be estimated at around 4368.\n After a robbery goes   in the western town of  ,   and the   are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal divisions threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang who raised him. Set in the American frontier in 1899,   follows the story of  , a member of  's  .\n In May 1899, after a   ferry heist in the thriving port city of  , Dutch Van der Linde and   are forced to   the area. One of the members,  , was killed, and   was shot (and later died). Davey’s brother Mac got separated from them and Sean MacGuire was capture by  ’s bounty hunters. The gang makes an attempt to cross the snowy mountains north to avoid the law, leaving their substantial money stash behind in Blackwater.  \n In order to fund their escape south, Dutch has the gang   a train belonging to the wealthy oil magnate  , despite Hosea's protests. A furious and vengeful Cornwall then hires the , who sends Agents   and   to apprehend the gang. Realizing that the progress of civilization is ending the time of outlaws, Dutch and the gang decide to gather up enough money to retire and escape the law for now. The gang   south to the state of  , on the plateau of   and the gang perform numerous jobs and heists to gather enough money, as Dutch continually promises one last, big heist that will secure their freedom. They will also be able to   Sean from the bounty hunters, thanks to gang member  , who they haven’t seen in months.\n After a deadly   with Cornwall’s men in   and Milton and Ross   Arthur outside of camp, the gang is forced to   in the state of  , in  . In  , they meet the   and  , two rival families potentially hoarding civil war gold. The gang works for both families to pit them against each other, but both families find out they have been played by the gang, resulting in an ambush by the Grays that kills Sean at Rhodes, and the Braithwaites kidnapping John and Abigail's son,  . The gang slaughters both families in retaliation, and learn that Jack has been sold to crime lord  , in the city of  .\n The   in Rhodes and the   on   led Milton and Ross to   the gang’s camp. Once the gang is safely relocated to  , Dutch, John, and Arthur   to Bronte's mansion in Saint Denis to confront him and retrieve Jack. Bronte returns Jack and embraces the gang, but then leads them into a  . In retaliation, Dutch, against Hosea's advice and pleas,   Bronte with the gang and feeds him to an alligator, murdering him, shocking both Arthur and John. At this point, Dutch has grown convinced that there is no future for the gang in the United States and leads them into a Saint Denis   to gather enough money to move overseas. Attracted in the city following Bronte’s kidnapping, the Pinkertons intervene, and Milton executes Hosea in front of the gang. A shootout ensues, in which Lenny is killed and John is arrested. Arthur, Dutch, Bill, Javier, and Micah escape on a boat to Cuba, while Charles heads back to regroup with the remaining gang members and relocate them.\n A torrential storm   the ship, and the men wash ashore the isle of  , where they become embroiled in a war between the tyrannical sugar   and the enslaved local population. The group successfully aids the revolution against the plantation owners and secures transport back to the United States. The group reunites with the rest of the gang at  . After fending off a Pinkerton   on the camp, Dutch becomes paranoid that a gang member is working as an informant, causing their failures. After they   again in  , Molly returns to camp after having disappeared and yells that she was the one that told the Pinkertons about the bank robbery, leading to Susan executing her in retaliation. Dutch obsesses over one last heist. Although he insists that they must wait to liberate John, Arthur and Sadie   Dutch to rescue him, angering the latter. Soon after, Dutch manipulates a local   into conflict with the   to draw attention away from the gang, against Arthur's wishes. Dutch begins to doubt Arthur's loyalty, in part facilitated by Micah Bell's manipulations, who has eagerly taken Hosea's role as Dutch's right-hand man.\n Meanwhile, Arthur becomes concerned that Dutch is no longer the man he knew, increasingly resorting to murder, revenge, and paranoia, and abandoning their ideals. Arthur   discovers that he has contracted tuberculosis from when he collected a debt from a diseased farmer,   back in Horseshoe Overlook, giving him only a short time to live. Faced with his own mortality, Arthur reflects on his actions and how to protect the gang following his death.\n Several gang members become disenchanted and leave, while Dutch and Micah arrange one final heist of an Army payroll train. Arthur convinces John that following the heist he must leave and start a new life with his family. Dutch later   Cornwall, blaming him for the Pinkerton's actions. Arthur's faith in Dutch, which had been shaken when the latter once abandoned the former to the U.S. Army during an  , is finally shattered when he leaves John for dead during the   and   to rescue Abigail when she is captured by Milton. Arthur disobeys Dutch's orders and rescues Abigail, with Sadie's help. During the rescue, Arthur is ambushed by Milton, who reveals that Micah had been working as an informant for the Pinkertons since their return from Guarma before he is killed by Abigail. \n Before Arthur heads back to camp to confront Micah, he tells the women to leave for safety, bidding them farewell. Arthur arrives at the camp telling Dutch that Micah is the Pinkertons informant with the latter denying it. This initiates a standoff between Arthur and Micah. John unexpectedly appears telling Dutch he left him to die. Arthur tells everyone to pick their side and the gang is dissolved with Susan and John siding with him. Javier announces that Pinkertons have arrived which distracted Susan allowing Micah to fatally shoot her. Dutch draws his guns and tells everyone who is ''with him'' and ''betraying him''.  ,  ,  ,  , and   joins Dutch's side against John and Arthur. Before anything could happen, Pinkertons led by   launch an assault on Beaver Hollow, but all eight manage to flee into the wilderness. Arthur accepts his fate and either buys John time to escape by confronting the Pinkertons, or heads back to camp to retrieve Dutch's money stash. After either option, Micah ambushes Arthur and Dutch intervenes in their fight. Arthur convinces Dutch to leave Micah with the latter telling him to join him and get the Blackwater money. Dutch abandons both men and Micah angrily leaves. If played honorably, Arthur succumbs to his tuberculosis and injuries and peacefully dies facing the sunrise with a   basking under the sun. If played dishonorably, Micah either executes him with his revolver (if Arthur aids John's escape) or stabs him (if he goes back to camp for the money) and in place of the buck, the player will see a   under the rain.\n Eight years later, John is attempting to lead an honest life and provide a living for Abigail and their son Jack. Finding work at  , John is forced to fight back against a group of outlaws threatening his employer. Believing that John will never escape his old life, Abigail leaves with Jack. In order to convince Abigail he's changed, John buys   with the intention of turning it into a ranch. He reunites with several surviving gang members, including Uncle, Sadie, and Charles. Uncle and Charles help John build his ranch while Sadie provides him with bounties to pay off his bank loans. Upon Abigail's return, John proposes to her. Eventually, Sadie comes across information of that one of Micah's men is in Strawberry and informs Charles and John. Abigail, fearing for John's life pleads him not to go but he tells her to understand that were it not for Arthur's sacrifice; everything they worked for including the ranch wouldn't exist. John leaves with Sadie and Charles to avenge Arthur. The trio came across   and threaten to hang him if he wouldn't tell them where Micah is. Cleet then reveals that he is at Mount Hagen with   and that they fell out because of Micah killing a little girl he tried to protect. Cleet will either be hanged or shot by Sadie.\n After arriving at Micah's camp, Charles and Sadie are wounded by his men, forcing John to continue alone. After gunning down several of Micah's men, including  , John confronts Micah and Sadie corners him. Dutch unexpectedly appears, having reunited with Micah to recover the stashed Blackwater money. Micah then takes Sadie hostage and initiates a Mexican standoff between the three. After an exchange of words, where Dutch accuses John of betraying the gang during their final days, Dutch shoots Micah for betraying the gang, Micah drops Sadie and tries to kill both of them but John manages to end Micah for good. With Micah dead, John tries to thank Dutch but he angrily ignores it and leaves without saying a word. John then takes the money that Micah and Dutch had since recovered from Blackwater, and uses it to fully pay off his loan. Later, John formally marries Abigail, and they both look forward to living a new life on their ranch, alongside Uncle and Jack, while Charles and Sadie leave to pursue their own futures.\n The fates of surviving gang members are revealed in newspaper articles, letters, NPC dialogue, random encounters, and several mid-credit scenes: Pearson became the proprietor of the general store in Rhodes, Swanson became a priest in New York, Tilly married a lawyer and resides in Saint Denis, Mary-Beth became a romance novelist, Karen presumably died of Alcoholism, and Strauss was arrested and killed in captivity, staying loyal to the gang and revealing none of their secrets. Meanwhile,  , now working for the  , discovers Micah's corpse. He and his partner   follow the trail straight to John's ranch and spy on him, foreshadowing the events of the   four years later.\n Upon 100% completion, a scene will play, depicting John Marston visiting Arthur Morgan's grave after getting revenge on Micah. John looks at the grave to which he says \"I guess we're just about done, my friend.\"\n On October 16th, 2016, Rockstar Games changed all of their social media and Newswire images to two red and black Rockstar logos, one of which appeared faded in a similar way to several   screenshots. The following day, Rockstar teased another photo, appearing to show Dutch's Gang walking in front of the sunset. On October 18th, 2016, Rockstar formally announced  , and a trailer was released on October 20th, 2016.\n On May 22nd, 2017, Rockstar announced the game was delayed until spring 2018 and released screenshots from the game.\n On September 28th, 2017, Rockstar released the second trailer, revealing Arthur Morgan as the game's protagonist and Dutch van der Linde as one of the central characters. The trailer also revealed that the number \"2\" had been changed to the Roman numeral \"II,\" similar to that of the   series.\n On February 1st, 2018, Rockstar delayed the game for the second time, announcing the release date for October 26th, 2018, along with 7 new screenshots of the game. \n A few months later on April 30, 2018, Rockstar announced that a third official trailer would be coming the following Wednesday on May 2, 2018, at 11 AM Eastern time. Along with the announcement, they also added a promotional video snippet showing the protagonist, Arthur Morgan, holding a revolver along with the date of the release of the third trailer. \n On May 3 and May 4, 2018, several news outlets gave their first hands-on impressions of the game,  with a total of 33 new screenshots released as well. On May 4, Rockstar Games also announced that they will unveil first details on the game's special editions and more the following month.  Two days later on May 6, Rockstar released 10 additional screenshots scattered out between their Facebook, Instagram and Twitter accounts. \n The following month on June 4, Rockstar Games released first details on the game's special editions including digital pre-order bonuses, Collector's Box and more. \n On July 23, announced the Red Dead Redemption II Complete Official Guidebook and the two variants of it, as well as confirming the release date of October 26 for the book. \n On July 31st, 2018 Rockstar announced that the pre-order bonuses have been extended to August 15th, 2018.\n On August 8, 2018, Rockstar Games announced that an official gameplay video of the game would be released the following day on August 9, 2018, at 11 AM Eastern time. Along with the announcement, a promotional image was also attached to the Newswire post. \n  On August 30, 2018, Rockstar Games announced the Outlaw Essentials Collection, featuring various limited-edition items, everything from t-shirts, domino sets and shot glasses, to iPhone cases and much more.  The collection is planned to release on the Rockstar Warehouse in the near future.\n On September 5, 2018, Rockstar Games posted a proclamation from the   issuing the killing or capture of Dutch van der Linde. The proclamation features significant plot details. \n The following day on September 6, 2018, Rockstar Games posted a total of 23 new promotional character art for various members of the Van der Linde gang. With an interval of 30 minutes between each. \n The next day on September 7, 2018, Rockstar Games announced a dedicated page for the Van der Linde gang on the official Red Dead Redemption II website featuring all of the original artwork along with quotes and bios for each character of the gang. They also made the original artwork available for download via the Rockstar Downloads page. \n  Pre-ordering any version of the game includes the following:\n The digital versions purchased through the Xbox and PlayStation Stores include the above, and additionally, include:\n The   contains a selection of exclusive content for Story Mode including:\n  The   contains all the Story Mode content from the Special Edition plus additional bonuses for a head start in online. Get access to three weapons at the Gunsmiths in Story Mode and online: the Volcanic Pistol, Pump Action Shotgun, and Lancaster Varmint Rifle.\n  The  , available exclusively from select retailers and the Rockstar Warehouse, features a curated assortment of outlaw essentials all packaged in a thick-gauged metal tithing box (  sold separately).\n The   is presented in two distinct variations:\n Packed with essential information about every mission, character, and feature of this vast and detailed world, the Standard Edition includes an at-a-glance walkthrough, dedicated maps chapter, comprehensive reference sections, and an all-encompassing index.\n  The premium hardcover Collector’s Edition features everything from the Standard Edition, printed on superior quality art paper, and also includes an exclusive character art gallery.\n Both editions of the guidebook are available after the game's launch on October 26, 2018. \n  received \"universal acclaim\" reviews on Metacritic getting a metascore of 93/100 on PC  based on 44 critic reviews, and 97/100 on both PS4  & Xbox One  based on 99 critic reviews and 33 critic reviews respectively.",
        "attributes": {
            "Developer": "Rockstar Studios [ 1 ]",
            "Publisher": "Rockstar Games",
            "Release date": "October 26, 2018 (PS4, Xbox One) November 5, 2019 (PC) December 5, 2019 (Steam)",
            "Genre": "Action-adventure",
            "Engine": "RAGE",
            "Modes": "Singleplayer, Multiplayer",
            "Rating": "CERO : Z ESRB : M PEGI : 18 USK : 18 ACB : MA15+",
            "Platforms": "Native ps4 PlayStation 4 xboxone Xbox One ps4pro Playstation 4 Pro xboxonex Xbox One X pc Microsoft Windows stadia Google Stadia Backward Compatible PlayStation 5 Xbox Series X/S",
            "Media": "Blu-ray, digital download",
            "System requirements": "Console : 105 GB Minimum [ 2 ]",
            "Reviews": "metacritic Metacritic : 97% gamerankings Gamerankings : 96.45%",
            "PC": "Steam",
            "Xbox": "Xbox Network",
            "PlayStation": "PSN"
        }
    },
    {
        "url": "https://detroit-become-human.fandom.com/wiki/Traci_(protagonist)",
        "name": "Traci",
        "image": "https://static.wikia.nocookie.net/detroit-become-human/images/6/6a/TracyIcon.png/revision/latest/scale-to-width-down/268?cb=20211128224248",
        "description": "Traci  was originally the name of a     and the cut fourth playable protagonist in  . She had around five to six scenes  written by  , but he later made the decision to remove her due to the increasing complexity of the branching narrative. \n Her name was repurposed in the final game to refer to all WR400 androids. It is unknown if all WR400 androids were also originally named \"Traci\" or if it was a unique name that she chose for herself.\n There is little known about Traci. According to  , Traci was going to disguise herself as a human and work as a journalist, where she could attempt to “tip the scales in favor of one side or the other\" depending on the player's choices. The artbook also uses the name \"Nathalie\" to refer to her, likely to avoid confusion with the repurposed name. According to concept artist Mikael Leger, \"Her initial story arc was amazing\" and describes her as   Traci.  He also confirms that \"Nathalie\" was an alias she could assume as part of her undercover journalism work.  \n There is concept art depicting Traci at  . It is unknown what circumstances would have led to this scene taking place.  \n According to concept artist Mikael Leger, there was a scene where Traci was going to be nude under a white coat.   This was probably going to take place during her chapter at the  , as she appears to be wearing the same white coat in the concept art of those deleted chapters.  \n It is unknown what Traci's personality would have been like. \n Traci is depicted as a young female android with shoulder-length blonde hair and brown eyes. All \"Traci\" models in the Eden Club shared this exact same appearance. \n Industry insider Tom Henderson has stated that Traci would have been able to \"morph her face and body\" as part of her abilities as a  . It is possible that this would have played into her ability to disguise herself for her work as a journalist.  \n Concept art of the Eden Club depicts Traci wearing a lacy black dress and a lingerie set. Later, she is shown wearing a knee-length black coat with heels at Ferndale Station and the Eden Club.      \n Traci's concept art uses the likeness of Israeli-American actress Alona Tal. Tom Henderson has also stated that American actress Amber Heard was used as inspiration for her.",
        "attributes": {
            "Aliases": "Nathalie",
            "Affiliation": "Jericho",
            "Place of birth": "CyberLife",
            "Species": "Android ( WR400 )",
            "Gender": "Female",
            "Eye color": "Brown",
            "Hair color": "Blonde",
            "Status": "Non-Canon",
            "Appears in:": "The Eden Club",
            "Portrayed by:": "Alona Tal"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/GTA_Online_Protagonist",
        "name": "Grand Theft Auto Online Protagonist",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556",
        "description": "",
        "attributes": {
            "Type": "CHARACTER",
            "Appears in": "Grand Theft Auto Online",
            "Mentioned in": "Grand Theft Auto V [UN] [UN] Mentioned in dialogue or other in-game media but not physically seen in-game.",
            "Voiced by": "Player (optionally, via microphone) None (officially)",
            "Motion capture by": "Various",
            "Gender": "Player's choice",
            "Height": "6' 0\" (1.83 m) Male 5' 9\" (1.75 m) Female [ 1 ]",
            "Also known as": "Boss Boss Used by Garage Mechanic, Executive Assistant, Nightclub staff and Brendan Darcy Partner Partner Used by Ron Jakowski and Franklin Clinton Playa Playa Used by Lamar Silent Protege Silent Protege Used by Trevor Philips Ron 's Silent Friend Ron 's Silent Friend Used by Trevor Philips Trevor's Favorite Mute Trevor's Favorite Mute Used by Trevor Phillips Doolie/Cadork/Cadidiot Doolie/Cadork/Cadidiot Used by JT Boyd Raver/Geezer Raver/Geezer Used by English Dave Stranger Stranger Used by Maude Eccles Silent, Psychotic Peon Silent, Psychotic Peon Used by Avon Hertz Casino Buddy Casino Buddy Used by Tao Cheng Kapitan Kapitan Used by Pavel Tour manager Tour manager Used during The Cayo Perico Heist scoping mission King/Queen King/Queen Used by Hao in the LS Car Meet introduction Other Boss Other Boss Used by Imani Sleeping Beauty Sleeping Beauty Used by Lamar during Short Trip - Seed Capital Pimp Pimp Used by Lamar Agent Agent Used by Agent ULP Jefe/Jefa Jefe/Jefa Used by Lupe. ('Boss' in Spanish) CBL CBL Used by Omega during the 'Sightseeing' Halloween event. (Carbon-based lifeform) Freshmeat Freshmeat Used by the Fooliganz Freshmeat-o Freshmeat-o Used by Dax Freshmeatus Freshmeatus Used by Dax Freshius meatusaruras Freshius meatusaruras Used by the Fooliganz Freshmeatloaf Freshmeatloaf Used by Dax Dr. Freshmeatowitz Dr. Freshmeatowitz Used by Dax FM FM Used by Dax. Short for 'Freshmeat' FM radio FM radio Used by Dax. FM - short for 'Freshmeat' MeatFresh MeatFresh Used by Dax. Carne Fresca Carne Fresca Used by Luchadora, mentioned by Dax. Spanish/Portuguese for 'Freshmeat'. Team Leader/TL Team Leader/TL Used by the Los Santos Angels Officer Officer Used by Vincent Effenburger",
            "Full name": "Name chosen by the player",
            "Nationality": "Player's choice",
            "Date of birth": "Player's choice Indeterminate (Enhanced Version) Any year from 1973 to 1992 (Migrated from PS3 and Xbox 360 only)",
            "Status": "Alive",
            "Home": "San Andreas Player's choice",
            "Family": "Mom and Dad (Enhanced Version) Up to 4 unnamed grandparents (PS3/Xb360 only)",
            "Main affiliations": "Crews (determinant) Organizations SecuroServ Lamar Davis Gerald Simeon Yetarian Ron Jakowski Trevor Philips Lester Crest Martin Madrazo Dom Beasley Garage Mechanic Brucie Kibbutz Merryweather Security (if hired) Merryweather Helicopter Pilot (if hired) Merryweather Boat Driver (if hired) Mugger (if hired) Heists Update Lester Crest Agent 14 Karen Daniels Trevor Philips Ron Jakowski Maxim Rashkovsky Avi Schwartzman Paige Harris Lowriders Lamar Davis Gerald Benny Executives and Other Criminals Brendan Darcy Further Adventures in Finance and Felony Assistant Bikers Motorcycle Clubs LJT Malc Sindy Zach Nelson Import/Export Office Mechanic Warehouse Mechanic Gunrunning Agent 14 Chester McCoy Smuggler's Run Ron Jakowski Charlie Reed The Doomsday Heist Lester Crest Agent 14 Phoenicia Rackman Avon Hertz (Formerly) Cliffford (Formerly) Bogdan (Formerly) Agent ULP After Hours Tony Prince Lazlow Jones English Dave Solomun Dixon Tale Of Us The Black Madonna Maude Eccles Paige Harris Simeon Yetarian Yohan Blair Arena War Alan Jerome Bryony Sacha Yetarian The Diamond Casino & Resort Agatha Baker Tom Connors Brucie Kibbutz Tao Cheng Tao Cheng's Translator Avery Duggan (Formerly) Thornton Duggan (Formerly) Vincent The Diamond Casino Heist Lester Crest Georgina Cheng Huang Jimmy De Santa Wendy Heist Crew Members Yung Ancestor (optional) Gerald Los Santos Summer Special Brendan Darcy Solomon Richards The Cayo Perico Heist Miguel Madrazo English Dave Pavel Juan Strickler ( Briefly Briefly While posing as Keinemusik tour manager ) Heist Crew Members (optional) Los Santos Tuners LS Car Meet Sessanta Kenny Dixon Jr. Mimi Hao Brucie Kibbutz The Contract F. Clinton and Partner Franklin Clinton Imani Chop Lamar Davis Dr. Dre DJ Pooh Vernon P The Families Ballas The Criminal Enterprises IAA (Special Agent; Formerly) Agent ULP (Formerly) Agent 14 Ammu-Nation Malc Assistant Lupe Tony Prince Omega Los Santos Drug Wars Ron Jakowski Fooliganz Dax Luchadora Labrat Mutt Downtown Cab Co. San Andreas Mercenaries Los Santos Angels (Team Leader) Charlie Reed Rooster McCraw Pernell Moss Avi Schwartzman The Chop Shop Jamal Amir Yusuf Amir (Buyer) Vincent Effenburger Bottom Dollar Bounties Maude Eccles Jenette Eccles Murph Agents of Sabotage Jodi Marshall Oscar Guzman",
            "Vehicles": "Player's choice",
            "Weapons": "Player's choice",
            "Businesses": "Player's choice",
            "Label": "Field"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_London",
        "name": "Protagonists in Grand Theft Auto: London 1969 and London 1961",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556",
        "description": "",
        "attributes": {
            "Label": "Field",
            "Type": "CHARACTER",
            "Appears in": "Grand Theft Auto: London 1969 Grand Theft Auto: London 1961",
            "Voiced by": "None",
            "Gender": "Male",
            "Also known as": "The Cheese Grater The Cheese Grater Used by Harold Cartwright Guv'nor Guv'nor Used by the Crisps' Contact Gorgeous Gorgeous Used by the Crisps' Contact, Albert Crisp and Pretty Charlie Einstein Einstein Used by the Crisps' Contact if they fail an objective Petal Petal Used by Albert Crisp Angel Angel Used by Albert Crisp Sunbeam Sunbeam Used by Keith Endeavour Chambers Endeavour Chambers Used by the British government while posing as Endeavour Chambers Agent Temple Agent Temple Used by the British government while posing as Agent Temple",
            "Full name": "Character chosen by the player",
            "Nationality": "British",
            "Date of birth": "Not given",
            "Status": "Alive",
            "Home": "London , United Kingdom",
            "Family": "Unnamed child (c. 1969) [ 1 ] Unnamed girlfriend/wife (c. 1969) [ 2 ] [ 3 ] [ 4 ] [ 5 ]",
            "Main affiliations": "Jack Parkinson Albert Crisp (Formerly) Archie Crisp (Formerly) Harold Cartwright (Formerly) Her Majesty's Secret Service (Anonymously)",
            "Vehicles": "Player's choice",
            "Weapons": "Player's choice",
            "Businesses": "Espionage Car theft Contract killing Hired driver Drug dealing"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_2_(GBC)",
        "name": "Protagonists in Grand Theft Auto 2 (Game Boy Color)",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556",
        "description": "",
        "attributes": {
            "Type": "CHARACTER",
            "Appears in": "Grand Theft Auto 2 (Game Boy Color)",
            "Voiced by": "None",
            "Gender": "Player's choice",
            "Also known as": "Gecko Jumbo Kosai Rooster THC-303 Comrade Grasshopper Kiddo",
            "Full name": "Character chosen by the player",
            "Nationality": "Player's choice",
            "Date of birth": "Not given",
            "Status": "Alive",
            "Home": "Avalon , Downtown District Morton , Residential District Tedium , Industrial District , Anywhere City",
            "Family": "Unknown",
            "Main affiliations": "The Guider Zaibatsu Corporation Loonies Yakuza SRS Rednecks Russian Mafia Hare Krishna",
            "Vehicles": "Player's choice",
            "Weapons": "Player's choice",
            "Businesses": "Car theft Contract killing Hired driver Drug dealing"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/Stretch_(character)",
        "name": "Stretch",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556",
        "description": "",
        "attributes": {
            "Label": "Field",
            "Type": "CHARACTER",
            "Appears in": "Grand Theft Auto V",
            "Voiced by": "Hassan Johnson",
            "Gender": "Male",
            "Also known as": "Stretch OG Stretch OG Stretch Newspaper articles published after The Third Way Stri-zetch",
            "Full name": "Harold Joseph",
            "Nationality": "American",
            "Date of birth": "Not given",
            "Place of birth": "Los Santos , San Andreas",
            "Status": "Deceased [ 1 ]",
            "Date of death": "2013",
            "Place of death": "BJ Smith Recreational Center , Chamberlain Hills , Los Santos",
            "Cause of death": "Beaten or stabbed to death by Michael De Santa during a shootout with the Original Covenant Ballas (Gold medal requirement) .",
            "Home": "Strawberry , Los Santos",
            "Family": "Unnamed mother Renatta Sidwell (Ex-girlfriend) Unnamed child",
            "Main affiliations": "Chamberlain Gangster Families (Formerly) Ballas Franklin Clinton (Formerly) Lamar Davis (Formerly) Demarcus Bradley",
            "Vehicles": "Felon Jackal",
            "Weapons": "Pistol",
            "Businesses": "Drug dealing Gang banging",
            "Phone Number": "3465550122"
        }
    },
    {
        "url": "https://gta.fandom.com/wiki/Protagonists_in_GTA_(1997_game)",
        "name": "Protagonists in Grand Theft Auto",
        "image": "https://static.wikia.nocookie.net/gtawiki/images/6/6d/InvisibleHeroImage.png/revision/latest/scale-to-width-down/268?cb=20241106091556",
        "description": "",
        "attributes": {
            "Label": "Field",
            "Type": "CHARACTER",
            "Appears in": "Grand Theft Auto",
            "Voiced by": "None",
            "Gender": "Player's choice",
            "Also known as": "Note: The dialogues were not changed after the addition of female protagonists. Aruzo Aruzo Used by Sonetti's Right-Hand Man Bubby's baby Bubby's baby Used by the Vercotti Family contact during Gangsta Bang - Phone 2 Monkey Boy Monkey Boy Used by the Vercotti Family contact Pretty boy Pretty boy Used by El Burro Flyboy Flyboy Used by Bryson Rude boy Rude boy Used by Brother Marcus Rankin' bwoy Rankin' bwoy Used by Brother Marcus",
            "Full name": "Character chosen by the player",
            "Nationality": "Player's choice",
            "Date of birth": "Not given",
            "Status": "Alive",
            "Home": "Vice City San Andreas ( Formerly ) Liberty City ( Formerly )",
            "Family": "Unnamed mother Unnamed father",
            "Main affiliations": "Brother Marcus Brotherhood of Jah Army of Love Samuel Deever (Formerly) El Burro (Formerly) Uncle Fu Uncle Fu's Crime Syndicate Robert \"Bubby\" Seragliano Vercotti Crime Family",
            "Vehicles": "Player's choice",
            "Weapons": "Player's choice",
            "Businesses": "Car theft Contract killing Hired driver Drug dealing"
        }
    }
]